#include <stdio.h>

main()
{
    int i, j;

    char dancer1[4][4] = {
        {' ', 'o', ' '},
        {'/', '|', '\\'},
        {'/', ' ', '\\'}};
    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 3; j++)
        {
            printf("%c", dancer1[i][j]);
        }
        printf("\n");
    }

    char dancer2[4][4] = {
        {' ', 'o', ')'},
        {'/', '|', ' '},
        {'/', ' ', '\\'}};

    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 3; j++)
        {
            printf("%c", dancer2[i][j]);
        }
        printf("\n");
    }

    char dancer3[4][4] = {
        {' ', 'o', ' '},
        {'/', '|', '>'},
        {'/', ' ', '\\'}};

    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 3; j++)
        {
            printf("%c", dancer3[i][j]);
        }
        printf("\n");
    }

    char dancer4[4][4] = {
        {' ', 'o', ' '},
        {'/', '|', '\\'},
        {'/', ' ', '>'}};

    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 3; j++)
        {
            printf("%c", dancer4[i][j]);
        }
        printf("\n");
    }

    return 0;
}

/*

假设dancer的初始状态时
 o
/|\
/ \
我们现在规定下面的命令形式：a-b
a 是1时，表示动手臂；是2时，表示动腿；

在a是1的情况下， b 是1时， 表示动手臂伸直；是2时，表示动手臂蜷缩；是3时，表示手臂摸头
在a是2的情况下， b 是1时， 表示动腿伸直；是2时，表示动腿蜷缩；

显然命令只有 1-1  1-2  1-3  2-1  2-2

*/
